code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗаполнениеЖурналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеЖурналов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьЖурналВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьЖурналИсходящихДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьЖурналОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗаполнениеЖурналов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьЖурналы(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Предупреждение("Укажите начало и конец периода.");
		Возврат;
	КонецЕсли;
	
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		Предупреждение("Укажите корректный период.");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ЗаполнитьЖурналВходящихДокументов
		И НЕ Объект.ЗаполнитьЖурналИсходящихДокументов
		И НЕ Объект.ЗаполнитьЖурналОпераций
	Тогда
		Предупреждение("Укажите, какие журналы необходимо заполнить.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЖурналыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЖурналыНаСервере()
	мОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Объект.ЗаполнитьЖурналВходящихДокументов Тогда
		мОбъект.ЗаполнитьЖурналВходящихДокументов(Объект.НачалоПериода, Объект.КонецПериода);
	КонецЕсли;
	
	Если Объект.ЗаполнитьЖурналИсходящихДокументов Тогда
		мОбъект.ЗаполнитьЖурналИсходящихДокументов(Объект.НачалоПериода, Объект.КонецПериода);
	КонецЕсли;
	
	Если Объект.ЗаполнитьЖурналОпераций Тогда
		мОбъект.ЗаполнитьЖурналОпераций(Объект.НачалоПериода, Объект.КонецПериода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда 
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.УстановитьПериод(Объект.НачалоПериода, Объект.КонецПериода);
		НастройкаПериода.РедактироватьКакИнтервал	= Истина;
		НастройкаПериода.РедактироватьКакПериод		= Истина;
		НастройкаПериода.ВариантНастройки			= ВариантНастройкиПериода.Период;
		НастройкаПериода.ВариантПериода				= ВариантПериода.Год;
		НастройкаПериода.Редактировать();
		Объект.НачалоПериода = НастройкаПериода.ПолучитьДатуНачала();
		Объект.КонецПериода = НастройкаПериода.ПолучитьДатуОкончания();
	#Иначе
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериода, Объект.КонецПериода);
		Если Диалог.Редактировать() Тогда 
			Объект.НачалоПериода = Диалог.Период.ДатаНачала;
			Объект.КонецПериода = Диалог.Период.ДатаОкончания;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
